# GetCenter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..GetCenter Method
AssemblyInstance Class See Also
---
Returns the center of the bounding box for the assembly instance. This is the default position for placed assembly instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ GetCenter()
```

Visual Basic
---
```text
Public Function GetCenter As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetCenter()
```

# ### Return Value
The position for the center of the assembly instance.
# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace